Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.JoinType
The JoinType class represents the join type filter expression.

Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.JoinType.#ctor
Initializes a new instance of the JoinType class.